/**
//════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                            //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ ＢＥＴＡ                          //
//                                                                                            // 
//                                         Ｖ：2．5．0                                         // 
//                                                                                            // 
//                                                                                            // 
//          ██████╗ ██╗███████╗████████╗███████╗██████╗     ███╗   ███╗██████╗                // 
//         ██╔════╝ ██║██╔════╝╚══██╔══╝██╔════╝██╔══██╗    ████╗ ████║██╔══██╗               // 
//         ██║  ███╗██║█████╗     ██║   █████╗  ██║  ██║    ██╔████╔██║██║  ██║               // 
//         ██║   ██║██║██╔══╝     ██║   ██╔══╝  ██║  ██║    ██║╚██╔╝██║██║  ██║               // 
//         ╚██████╔╝██║██║        ██║   ███████╗██████╔╝    ██║ ╚═╝ ██║██████╔╝               // 
//          ╚═════╝ ╚═╝╚═╝        ╚═╝   ╚══════╝╚═════╝     ╚═╝     ╚═╝╚═════╝                //
//                                                                                            //
//                                                                                            //
//                                                                                            //
//                                                                                            //
//════════════════════════════════════════════════════════════════════════════════════════════//
*                                                                 
  * @project_name : Gifted-Md
   * @author : Gifted Tech.
   * @youtube : https://www.youtube.com/@giftedtechnexus
   * @description : Gifted-Md ,A Multi-functional whatsapp user bot.
   * @version 2.5.0
*
* 
   * Created By Gifted Tech.
   * © 2024 Gifted-Md.


*/


























function _0xecd4(_0x2b51c9,_0x11a28d){const _0x1235bc=_0x1235();return _0xecd4=function(_0xecd45a,_0x3d973f){_0xecd45a=_0xecd45a-0x1d4;let _0x2fe6c2=_0x1235bc[_0xecd45a];return _0x2fe6c2;},_0xecd4(_0x2b51c9,_0x11a28d);}const _0x25fad4=_0xecd4;(function(_0x5c80d7,_0x55f859){const _0x40ff25=_0xecd4,_0x2d39c7=_0x5c80d7();while(!![]){try{const _0x1b5135=-parseInt(_0x40ff25(0x1d9))/0x1+parseInt(_0x40ff25(0x1e1))/0x2*(-parseInt(_0x40ff25(0x1de))/0x3)+parseInt(_0x40ff25(0x1e2))/0x4+-parseInt(_0x40ff25(0x1e6))/0x5+parseInt(_0x40ff25(0x1dd))/0x6*(-parseInt(_0x40ff25(0x1d7))/0x7)+parseInt(_0x40ff25(0x1dc))/0x8+parseInt(_0x40ff25(0x1db))/0x9;if(_0x1b5135===_0x55f859)break;else _0x2d39c7['push'](_0x2d39c7['shift']());}catch(_0x2fe8bb){_0x2d39c7['push'](_0x2d39c7['shift']());}}}(_0x1235,0xa8c4c));import _0x44b403 from'../lib/uploadImage.js';import{sticker}from'../lib/sticker.js';function _0x1235(){const _0x17f990=['757536iscSoa','6htFPMj','36XkKYUR','sendFile','download','18734ZOaSvD','3745048SqdKFb','packname','msg','*[❗𝐈𝐍𝐅𝐎❗]\x20respond\x20to\x20a\x20image\x20to\x20make\x20it\x20circle\x20sticker*','5924095iMFGyi','quoted','API','chat','reply','sticker.webp','9294943WTJuEN','command','1260204pHxTQi','dzx','31910382vXFnQQ'];_0x1235=function(){return _0x17f990;};return _0x1235();}let handler=async(_0x57fdc0,{conn:_0x16f073,text:_0x2679a3})=>{const _0x183070=_0xecd4;try{let _0x28ec5b=_0x57fdc0[_0x183070(0x1e7)]?_0x57fdc0[_0x183070(0x1e7)]:_0x57fdc0,_0x27930b=(_0x28ec5b[_0x183070(0x1e4)]||_0x28ec5b)['mimetype']||'',_0x5433f9=await _0x28ec5b[_0x183070(0x1e0)](),_0x42d769=await _0x44b403(_0x5433f9),_0x44ed09=global[_0x183070(0x1e8)](_0x183070(0x1da),'/api/canvas/circle',{'url':_0x42d769}),_0x394e79=await sticker(null,_0x44ed09,global[_0x183070(0x1e3)],global['author']);_0x16f073[_0x183070(0x1df)](_0x57fdc0[_0x183070(0x1d4)],_0x394e79,_0x183070(0x1d6),'',_0x57fdc0,{'asSticker':!![]});}catch(_0xd89cd4){_0x57fdc0[_0x183070(0x1d5)](_0x183070(0x1e5));}};handler[_0x25fad4(0x1d8)]=/^scircle|circle$/i;export default handler;

